test/good/inheritance-state-mutation-1.cfg.dot
digraph "inheritance-state-mutation-1" {
    node [shape=box];
    subgraph "cluster_C__init_1766" {
        label="C__init_1766";
        "C__init_1766_142" [label="self.m = m"];
        "C__init_1766_143" [label="self.a = a",style=filled,fillcolor="#66A7DB"];
        "C__init_1766_142" -> "C__init_1766_143";
    }
    subgraph "cluster_C__updateBalance" {
        label="C__updateBalance";
        "C__updateBalance_145" [label="self.balance = 100"];
        "C__updateBalance_146" [label="self.balance -= 100"];
        "C__updateBalance_148" [label="self.m.set(3, 3)"];
        "C__updateBalance_150" [label="self.m.del(3)"];
        "C__updateBalance_152" [label="self.a.x = 42"];
        "C__updateBalance_154" [label="self.a.x += 42"];
        "C__updateBalance_156" [label="self.a.m.set(3, 3)"];
        "C__updateBalance_158" [label="self.a.m.del(3)",style=filled,fillcolor="#66A7DB"];
        "C__updateBalance_145" -> "C__updateBalance_146";
        "C__updateBalance_146" -> "C__updateBalance_148";
        "C__updateBalance_148" -> "C__updateBalance_150";
        "C__updateBalance_150" -> "C__updateBalance_152";
        "C__updateBalance_152" -> "C__updateBalance_154";
        "C__updateBalance_154" -> "C__updateBalance_156";
        "C__updateBalance_156" -> "C__updateBalance_158";
    }
}
